hkjgvugkjh/xr871-arduino/boards.txt
# XR871 Arduino Boards Configuration v1.5.0

menu.FlashSize=Flash Size
menu.UploadSpeed=Upload Speed

##############################################################
# XR871 EVB Board (official development board)
##############################################################

xr871_evb.name=XR871 EVB
xr871_evb.upload.tool=xr871_tool
xr871_evb.upload.maximum_size=102400
xr871_evb.upload.maximum_data_size=458752
xr871_evb.upload.protocol=serial

# CPU: Cortex-M4F @ 192MHz
xr871_evb.build.mcu=cortex-m4
xr871_evb.build.f_cpu=192000000L
xr871_evb.build.board=XR871_EVB
xr871_evb.build.core=xr871
xr871_evb.build.variant=xr871_evb

# Include Arduino libraries
xr871_evb.build.libraries=ADC,SPI,Wire,WiFi,Audio,OTA

# Linker script (RAM execution)
xr871_evb.build.ldscript={runtime.platform.path}/SDK/project/linker_script/gcc/xr871/appos.ld

# Flash configuration
xr871_evb.build.flash_size=1M
xr871_evb.build.flash_mode=qio
xr871_evb.build.flash_freq=80M

# Partition table
xr871_evb.build.partitions=image_xip

# Upload speed options
xr871_evb.menu.UploadSpeed.115200.upload.speed=115200
xr871_evb.menu.UploadSpeed.230400.upload.speed=230400
xr871_evb.menu.UploadSpeed.460800.upload.speed=460800
xr871_evb.menu.UploadSpeed.921600.upload.speed=921600

# Flash size options
xr871_evb.menu.FlashSize.1M.build.flash_size=1M

# XIP support
xr871_evb.build.xip=true
xr871_evb.build.xip_addr=0x10000000
xr871_evb.build.xip_size=525376

# WiFi firmware included
xr871_evb.build.wifi_fw=true
xr871_evb.build.net_fw=true

##############################################################
# XR871 Generic Board (custom hardware)
##############################################################

xr871_generic.name=XR871 Generic
xr871_generic.upload.tool=xr871_tool
xr871_generic.upload.maximum_size=102400
xr871_generic.upload.maximum_data_size=458752
xr871_generic.upload.protocol=serial

# CPU: Cortex-M4F @ 192MHz
xr871_generic.build.mcu=cortex-m4
xr871_generic.build.f_cpu=192000000L
xr871_generic.build.board=XR871_GENERIC
xr871_generic.build.core=xr871
xr871_generic.build.variant=xr871_generic

# Linker script
xr871_generic.build.ldscript={runtime.platform.path}/SDK/project/linker_script/gcc/xr871/appos.ld

# Flash configuration
xr871_generic.build.flash_size=1M
xr871_generic.build.flash_mode=qio
xr871_generic.build.flash_freq=80M

# Upload speed options
xr871_generic.menu.UploadSpeed.115200.upload.speed=115200
xr871_generic.menu.UploadSpeed.921600.upload.speed=921600

# Flash size options
xr871_generic.menu.FlashSize.1M.build.flash_size=1M
